In [1]:
import pandas as pd

# Create a DataFrame
data = {'Category': ['A', 'B', 'A', 'B', 'A'],
        'Value': [10, 20, 15, 25, 30]}
df = pd.DataFrame(data)

In [2]:
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30

In [3]:
# Group by 'Category' and calculate the mean value for each group
grouped = df.groupby('Category')['Value'].mean()
grouped

Category
A    18.333333
B    22.500000
Name: Value, dtype: float64

In [4]:
# Filter rows where 'Value' is greater than 20
filtered_df = df.query('Value > 20')
filtered_df

  Category  Value
3        B     25
4        A     30